# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..Clear Method
ExportLinetypeTable Class See Also
---
Removes all contents stored in Export line type table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace